Catalogs/ИА_БПКартыМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПКартыМаршрутов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ИА_БПТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПТипыТочекМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйБизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_БПТочкиМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПТочкиМаршрута</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_БПКартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыАдресацииЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПВариантыДней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммнаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияИстинно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияЛожно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадачВложенногоБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьАвторуНаПроверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеЛинии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСобытияТочекБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПВариантыОбработчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыВложенногоБП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСпособыЗаполненияДопРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыводимыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьПриСозданииЗадачи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПКартыМаршрутов/Ext/ManagerModule.bsl
Функция ПолучитьКартуМаршрута(КартаМаршрута) Экспорт
    Карта = КартаМаршрута.Карта.Получить();
    Если Карта = Неопределено Тогда
    	Карта = Новый ГрафическаяСхема;
    КонецЕсли;
    ЗаполнитьВКартеСвязанныеДанные(Карта, КартаМаршрута);
    
    Возврат Карта;
КонецФункции

Процедура ЗаполнитьВКартеСвязанныеДанные(Карта, КартаМаршрута) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПТочкиМаршрута.Ссылка,
    |   ИА_БПТочкиМаршрута.Имя,
    |   ИА_БПТочкиМаршрута.Ответственный,
    |   ИА_БПТочкиМаршрута.ЭтоУведомление
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   ИА_БПТочкиМаршрута.Владелец = &Владелец
    |   И НЕ ИА_БПТочкиМаршрута.ПометкаУдаления";
    Запрос.УстановитьПараметр("Владелец", КартаМаршрута);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    ЦветУведомлений   = WebЦвета.Льняной;
    ЦветОбычнойЗадачи = Новый Цвет(254, 253, 214);
    
    Пока Выборка.Следующий() Цикл
        Эл = Карта.ЭлементыГрафическойСхемы.Найти(Выборка.Имя);
        Если Эл <> Неопределено Тогда
            Если ИА_БФКС.РеквизитЕсть(Эл, "Пояснение") Тогда
            	Эл.Пояснение = Выборка.Ответственный;
            КонецЕсли; 
            Если ИА_БФКС.РеквизитЕсть(Эл, "ЦветФона") Тогда
                Если Выборка.ЭтоУведомление Тогда
                	Эл.ЦветФона = ЦветУведомлений;
                ИначеЕсли Эл.ЦветФона = WebЦвета.Льняной И НЕ Выборка.ЭтоУведомление Тогда
                    Эл.ЦветФона = ЦветОбычнойЗадачи;
                КонецЕсли; 
            	
            КонецЕсли; 
        КонецЕсли; 
    КонецЦикла;
КонецПроцедуры

Функция ПолучитьТипТочкиПоТипуЭлемента(ЭлементГрафСхемы) Экспорт
    Возврат ИА_Защита_НФ.КМ_ПолучитьТипТочкиПоТипуЭлемента(ЭлементГрафСхемы);
КонецФункции

Функция ПолучитьТочку(Карта, Имя, Тип = Неопределено, Наименование =  Неопределено) Экспорт
    ТолькоПоиск = Тип = Неопределено;
    Запрос = Новый Запрос(
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПТочкиМаршрута.Ссылка
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   ИА_БПТочкиМаршрута.Владелец = &Владелец
    |   И ИА_БПТочкиМаршрута.Имя = &Имя");
    Запрос.УстановитьПараметр("Имя", Имя);
    Запрос.УстановитьПараметр("Владелец", Карта);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Если ТолькоПоиск Тогда
            Возврат Выборка.Ссылка;
        КонецЕсли; 
        Спр = Выборка.Ссылка.ПолучитьОбъект();    
        Спр.ПометкаУдаления = Ложь;
    ИначеЕсли ТолькоПоиск Тогда
        ВызватьИсключение "Нет точки в системе """ + Карта + """  """ + Имя + """ !!!";
    Иначе
        Спр = Справочники.ИА_БПТочкиМаршрута.СоздатьЭлемент();
        Спр.Владелец        = Карта;
        Спр.Имя             = Имя;
    КонецЕсли; 
    Спр.Тип             = Тип;
    Спр.Наименование    = Наименование;
    
    Спр.ИсходящиеЛинии.Очистить();
    Спр.Записать();
    
    Возврат Спр.Ссылка;
КонецФункции

Функция ПолучитьТочкуСтарта(КартаМаршрута, ТочкаЗапуска = Неопределено, ВызыватьИсключение = Истина) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПТочкиМаршрута.Ссылка
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   ИА_БПТочкиМаршрута.Владелец = &Владелец
    |   И ИА_БПТочкиМаршрута.Тип = &Тип
    |   И (&ТочкаЗапуска_НО
    |           ИЛИ ИА_БПТочкиМаршрута.Ссылка = &ТочкаЗапуска)
    |   И НЕ ИА_БПТочкиМаршрута.ПометкаУдаления";
    Запрос.УстановитьПараметр("Владелец", КартаМаршрута);
    Запрос.УстановитьПараметр("Тип", Перечисления.ИА_БПТипыТочекМаршрута.Старт);
    Запрос.УстановитьПараметр("ТочкаЗапуска", ТочкаЗапуска);
    Запрос.УстановитьПараметр("ТочкаЗапуска_НО", НЕ ЗначениеЗаполнено(ТочкаЗапуска));
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Количество() = 0 Тогда
        Если ВызыватьИсключение Тогда
            ВызватьИсключение "Нет стартовых точек в """ + КартаМаршрута + " !";
        Иначе
            Возврат Неопределено
        КонецЕсли; 
        
    ИначеЕсли Выборка.Количество() > 1 И НЕ ЗначениеЗаполнено(ТочкаЗапуска) Тогда
        Если ВызыватьИсключение Тогда
            ВызватьИсключение "Стартовых точек " + Выборка.Количество() + " в """ + КартаМаршрута + ", и не передано, с чего начинать !";
        Иначе
            Возврат Неопределено
        КонецЕсли;        
    Иначе
         Выборка.Следующий();
         Возврат Выборка.Ссылка;
    КонецЕсли; 
КонецФункции

Функция РассчитатьПлановыеДатыВыполненияЗадач(Карта, ДатаЗапуска, ТочкаСтарта = Неопределено, НачальнаяТочка = Неопределено) Экспорт
    Если НачальнаяТочка = Неопределено Тогда
    	ТочкаСтарта = Справочники.ИА_БПКартыМаршрутов.ПолучитьТочкуСтарта(Карта, ТочкаСтарта);	
    Иначе
        ТочкаСтарта = НачальнаяТочка;
    КонецЕсли; 
    
    
    МассивТочекВЦиклах  = Справочники.ИА_БПКартыМаршрутов.ПолучитьТочкиЦиклов(Карта);
    
    Таб = Неопределено;
    ПройтиПоКартеМаршрутаДоКонцаСРасчетомДат(ТочкаСтарта
    , НачалоДня(ДатаЗапуска), НачалоДня(ДатаЗапуска), Таб, МассивТочекВЦиклах);
    
    ИА_БФС.ТЗ_УдалитьСтрокиПоУсловию(Таб, "НЕ ЗначениеЗаполнено(СтрокаТЗ.ВариантДлительности)");
    Таб.Сортировать("Порядок, ДатаНачала, ДатаОкончания");
    Возврат Таб;
КонецФункции



Функция ПолучитьТаблицуТочекКарты(КартаМаршрута) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные *, Ссылка как Точка ИЗ
    |	Справочник.ИА_БПТочкиМаршрута КАК Т
    |ГДЕ
    |	НЕ Т.ПометкаУдаления
    |	И Т.Владелец = &Карта";
    Запрос.УстановитьПараметр("Карта", КартаМаршрута);
    Результат = Запрос.Выполнить().Выгрузить();
    Возврат Результат;
КонецФункции

Функция ПолучитьТочкиЦиклов(КартаМаршрута) Экспорт
    Возврат ИА_Защита_НФ.КМ_ПолучитьТочкиЦиклов(КартаМаршрута);
КонецФункции

Функция ПолучитьСписокБППоКартеМаршрута(КартаМаршрута, УсловиеГде = "") Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПНоситель.Ссылка
    |ИЗ
    |   БизнесПроцесс.ИА_БПНоситель КАК ИА_БПНоситель
    |ГДЕ
    |   НЕ ИА_БПНоситель.ПометкаУдаления
    |   ";
    
    Если ТипЗнч(КартаМаршрута) = Тип("СправочникСсылка.ИА_БПКартыМаршрутов") Тогда
        Запрос.Текст = Запрос.Текст + " И ИА_БПНоситель.ИА_КартаМаршрутаБП = &Об";
    ИначеЕсли ТипЗнч(КартаМаршрута) = Тип("СправочникСсылка.ИА_БПМаршрутЗадач") Тогда
        Запрос.Текст = Запрос.Текст + " И ИА_БПНоситель.ИА_МаршрутЗадачБП = &Об";
    КонецЕсли; 
    
    Запрос.УстановитьПараметр("Об", КартаМаршрута);
    Если ЗначениеЗаполнено(УсловиеГде) Тогда
    	Запрос.Текст = Запрос.Текст + Символы.ПС + " И ( " + УсловиеГде+ " ) ";
    КонецЕсли; 
    
    Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    Возврат Результат;
КонецФункции

Процедура ПроизвестиУдалениеНеиспользуемыхТочек(КартаМаршрута = Неопределено, ВыводитьСообщения = Истина) Экспорт
    МассивТочек = ИА_БФС.Запрос_ВыполнитьВТЗ(
    "ВЫБРАТЬ   разрешенные
    |   ИА_БПТочкиМаршрута.Ссылка
    |ИЗ
    |   Справочник.ИА_БПТочкиМаршрута КАК ИА_БПТочкиМаршрута
    |ГДЕ
    |   ИА_БПТочкиМаршрута.ПометкаУдаления
    |   И (&КМ_НО
    |           ИЛИ ИА_БПТочкиМаршрута.Владелец = &КМ)"
    ,Новый Структура("КМ, КМ_НО", КартаМаршрута, НЕ ЗначениеЗаполнено(КартаМаршрута))).ВыгрузитьКолонку("Ссылка");
	
	УстановитьПривилегированныйРежим(истина);
	
    Таб = НайтиПоСсылкам(МассивТочек);
    
    Счетчик = 0;
    Для каждого Точка Из МассивТочек Цикл
    	М = Таб.НайтиСтроки(Новый Структура("Ссылка", Точка));
        Если М.Количество() = 0 Тогда
            Об = Точка.ПолучитьОбъект();
            Об.Удалить();
        	Счетчик = Счетчик + 1;
        КонецЕсли; 
    КонецЦикла; 
	
	УстановитьПривилегированныйРежим(ложь);
	
    Если ВыводитьСообщения Тогда
        ИА_БФКС.СообщениеОбОшибке("Удалено " + Счетчик + " точек."); 	
    КонецЕсли;     
КонецПроцедуры
 

//_____________________________________________________________

Процедура ПройтиПоКартеМаршрутаДоКонцаСРасчетомДат(Точка, ДатаЗапуска, ДатаСтарта, Таб, МассивТочекВЦиклах)
    Если Таб = Неопределено Тогда
        Таб = ИА_БФС.ТЗ_НоваяТаблицаЗначений("Точка, Порядок, ДатаНачала, ДатаОкончания, ВариантДлительности, ДлительностьВыполнения");	
    КонецЕсли;
    
    СтрокаТаб = Таб.Найти(Точка, "Точка");
    
    Если СтрокаТаб <> неопределено Тогда
        // Зашли в точку не в первый раз! 
        Если МассивТочекВЦиклах.Найти(Точка) <> Неопределено Тогда
            // Циклы пропускаем безусловно.
            Возврат;
        КонецЕсли; 
    Иначе
        СтрокаТаб = Таб.Добавить();
        СтрокаТаб.Точка = Точка;
        СтрокаТаб.Порядок = Точка.ПорядокВКарте;
    КонецЕсли; 
    
    Если ИА_БФКС.РеквизитЕсть(Точка, "СтартЧерез") Тогда
        Если ЗначениеЗаполнено(Точка.ВариантДлительности) Тогда
            ДатаНачала = ИА_БПС.ДобавитьКДате(ДатаСтарта, Точка.ВариантДлительности, Точка.СтартЧерез);
            ДатаКонца  = ИА_БПС.ДобавитьКДате(ДатаНачала, Точка.ВариантДлительности, Точка.ДлительностьВыполнения);
        Иначе
            ДатаНачала = НачалоДня(ДатаЗапуска);           
            ДатаКонца  = ДатаНачала;
        КонецЕсли; 
    Иначе
        ДатаНачала = НачалоДня(ДатаЗапуска);
        
        Если ЗначениеЗаполнено(Точка.ВариантДлительности) Тогда
            ДатаКонца = ИА_БПС.ДобавитьКДате(ДатаНачала, Точка.ВариантДлительности, Точка.ДлительностьВыполнения);
        Иначе
            ДатаКонца = ДатаНачала;
        КонецЕсли; 
    КонецЕсли;
    
    Если СтрокаТаб.ДатаОкончания = Неопределено ИЛИ ДатаКонца > СтрокаТаб.ДатаОкончания Тогда
        СтрокаТаб.ДатаНачала = ДатаНачала;
        СтрокаТаб.ВариантДлительности = Точка.ВариантДлительности;
        СтрокаТаб.ДлительностьВыполнения = Точка.ДлительностьВыполнения;
        СтрокаТаб.ДатаОкончания = ДатаКонца;
    КонецЕсли; 
    
    // Обойдем план дальше
    ИсходящиеТочки = Справочники.ИА_БПТочкиМаршрута.ПолучитьИсходящиеТочки(Точка);
    Для каждого СледующаяТочка Из ИсходящиеТочки Цикл
        ПройтиПоКартеМаршрутаДоКонцаСРасчетомДат(СледующаяТочка, СтрокаТаб.ДатаОкончания, ДатаСтарта, Таб, МассивТочекВЦиклах);
    КонецЦикла; 
КонецПроцедуры
